# Pandas

In [1]:
# -U  <---  Update
# !pip install -U pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [4]:
DataFrame = pd.read_csv('melb_data.csv')
DataFrame.head()

,Unnamed: 0,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,5,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,6,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

In [5]:
type(DataFrame)

pandas.core.frame.DataFrame

In [6]:
animals = ['Tiger', 'Bear', 'Moose']
p_animals = pd.Series(animals)
p_animals

0    Tiger
1     Bear
2    Moose
dtype: object

In [7]:
print(type(animals))
print(type(animals[2]))

<class 'list'>
<class 'str'>

In [8]:
print(type(p_animals))
print(type(p_animals[2]))
# https://www.geeksforgeeks.org/python-pandas-series-dtype/
print( p_animals.dtype )

p_animals.dtype

<class 'pandas.core.series.Series'>
<class 'str'>
object

dtype('O')

In [9]:
animals = ['Tiger', 'Bear', None]
p_animals = pd.Series(animals)
p_animals

0    Tiger
1     Bear
2     None
dtype: object

In [10]:
print(type(animals[2]))
print(type(p_animals[2]))

<class 'NoneType'>
<class 'NoneType'>

In [11]:
animals = [2.0, 1.5, 20]
p_animals = pd.Series(animals)
p_animals

0     2.0
1     1.5
2    20.0
dtype: float64

In [12]:
print(type(animals[2]))
print(type(p_animals[2]))

<class 'int'>
<class 'numpy.float64'>

In [13]:
animals = [2.0, 20, None]
p_animals = pd.Series(animals)
p_animals

0     2.0
1    20.0
2     NaN
dtype: float64

In [14]:
# https://en.wikipedia.org/wiki/NaN
# In computing, NaN standing for Not a Number, ___
# ___ is a particular value of a numeric data type ___
# ___ which is undefined as a number, such as the result of 0/0.

print(type(animals[2]))
print(type(p_animals[2]))

<class 'NoneType'>
<class 'numpy.float64'>

In [15]:
animals = {
    'n1': 'Tiger',
    'n2': 'Bear',
    'n3': None
}
p_animals = pd.Series(animals)
p_animals

n1    Tiger
n2     Bear
n3     None
dtype: object

In [16]:
print(p_animals['n3'])
print(p_animals.iloc[2])
print(p_animals.loc['n3'])

None
None
None

In [17]:
type(p_animals)

pandas.core.series.Series

In [18]:
p_animals.keys

<bound method Series.keys of n1    Tiger
n2     Bear
n3     None
dtype: object>

In [19]:
p_animals.keys()

Index(['n1', 'n2', 'n3'], dtype='object')

In [20]:
p_animals.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [21]:
p_animals.values

array(['Tiger', 'Bear', None], dtype=object)

In [22]:
p_animals = pd.Series(['Tiger', 'Bear', 'Moose'], index=['n1', 'n2', 'n3'])
p_animals

n1    Tiger
n2     Bear
n3    Moose
dtype: object

In [23]:
p_animals['n1']

'Tiger'

In [24]:
p_animals.loc['n1']

'Tiger'

In [25]:
for item in p_animals:
    print('Hi ' + str(item))

Hi Tiger
Hi Bear
Hi Moose

In [26]:
import numpy as np

In [27]:
np.sum(p_animals)

'TigerBearMoose'

In [28]:
animals = [2.0, 20.1, 5]
p_animals = pd.Series(animals)
np.sum(p_animals)

27.1

In [29]:
animals = [2.0, 20.1, 'Masoud']
# p_animals = pd.Series(animals, index = ['a', 'b' ,'c'])
p_animals = pd.Series(animals)
p_animals

0       2.0
1      20.1
2    Masoud
dtype: object

In [30]:
# https://github.com/dusty-nv/jetson-inference/issues/1640
# ----------------------------------------------------------------------------------
# https://github.com/dusty-nv/jetson-inference/issues/1640#issuecomment-1547996195
# for index, item in p_animals.iteritems():
# ----------------------------------------------------------------------------------

for index, item in p_animals.items():
    print('Hi ' + str(item) + ' ... index is ' + str(index))

Hi 2.0 ... index is 0
Hi 20.1 ... index is 1
Hi Masoud ... index is 2

In [31]:
p_animals =  pd.DataFrame(p_animals)
for i, row in p_animals.iterrows():
    print('i:', i, '----------> row:', row)
print()

for i, item in p_animals.itertuples():
    print('i:', i, '---------->          ', item)

i: 0 ----------> row: 0    2.0
Name: 0, dtype: object
i: 1 ----------> row: 0    20.1
Name: 1, dtype: object
i: 2 ----------> row: 0    Masoud
Name: 2, dtype: object

i: 0 ---------->           2.0
i: 1 ---------->           20.1
i: 2 ---------->           Masoud

In [32]:
animals = {
    'column 1': 'Tiger 1',
    'column 2': 'Bear 1',
    'column 3': 'Moose 1'
}
p_animals1 = pd.Series(animals)
animals = {
    'column 1': 'Tiger 2',
    'column 2': 'Bear 2',
    'column 3': 'Moose 2'
}
p_animals2 = pd.Series(animals)
animals = {
    'column 1': 'Tiger 3',
    'column 2': 'Bear 3',
    'column 3': 'Moose 3'
}
p_animals3 = pd.Series(animals)

print(p_animals1, '\n')
print(p_animals2, '\n')
print(p_animals3, '\n')

column 1    Tiger 1
column 2     Bear 1
column 3    Moose 1
dtype: object

column 1    Tiger 2
column 2     Bear 2
column 3    Moose 2
dtype: object

column 1    Tiger 3
column 2     Bear 3
column 3    Moose 3
dtype: object

In [33]:
df = pd.DataFrame([p_animals1, p_animals2, p_animals3], index=['row 1', 'row 2', 'row 3'])
df

      column 1 column 2 column 3
row 1  Tiger 1   Bear 1  Moose 1
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [34]:
df.loc['row 2']

column 1    Tiger 2
column 2     Bear 2
column 3    Moose 2
Name: row 2, dtype: object

In [35]:
df.loc[:, 'column 1']

row 1    Tiger 1
row 2    Tiger 2
row 3    Tiger 3
Name: column 1, dtype: object

In [36]:
df

      column 1 column 2 column 3
row 1  Tiger 1   Bear 1  Moose 1
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [37]:
df.loc['row 2'].loc['column 1']

'Tiger 2'

In [38]:
df.loc['row 1', 'column 2']

'Bear 1'

In [39]:
df.T

            row 1    row 2    row 3
column 1  Tiger 1  Tiger 2  Tiger 3
column 2   Bear 1   Bear 2   Bear 3
column 3  Moose 1  Moose 2  Moose 3

In [40]:
df.transpose()

            row 1    row 2    row 3
column 1  Tiger 1  Tiger 2  Tiger 3
column 2   Bear 1   Bear 2   Bear 3
column 3  Moose 1  Moose 2  Moose 3

In [41]:
df

      column 1 column 2 column 3
row 1  Tiger 1   Bear 1  Moose 1
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [42]:
# Return Series
df['column 2']

row 1    Bear 1
row 2    Bear 2
row 3    Bear 3
Name: column 2, dtype: object

In [43]:
# Return DataFrame
df[['column 2']]

      column 2
row 1   Bear 1
row 2   Bear 2
row 3   Bear 3

In [44]:
# Return DataFrame
df[['column 2', 'column 3']]

      column 2 column 3
row 1   Bear 1  Moose 1
row 2   Bear 2  Moose 2
row 3   Bear 3  Moose 3

In [45]:
df.loc[:, ['column 2', 'column 3']]

      column 2 column 3
row 1   Bear 1  Moose 1
row 2   Bear 2  Moose 2
row 3   Bear 3  Moose 3

In [46]:
# df2 = df.drop('row 1')
# df2

df.drop('row 1', inplace=True)
df

      column 1 column 2 column 3
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [47]:
# The value is not copied, but the memory address is copied.
df2 = df

In [48]:
df2.drop('row 2', inplace=True)
df2

      column 1 column 2 column 3
row 3  Tiger 3   Bear 3  Moose 3

In [49]:
df

      column 1 column 2 column 3
row 3  Tiger 3   Bear 3  Moose 3

In [50]:
# In this case, the values are copied
# df2 = df.copy()

In [51]:
animals = {
    'column 1': 'Tiger 1',
    'column 2': 'Bear 1',
    'column 3': 'Moose 1'
}
p_animals1 = pd.Series(animals)
animals = {
    'column 1': 'Tiger 2',
    'column 2': 'Bear 2',
    'column 3': 'Moose 2'
}
p_animals2 = pd.Series(animals)
animals = {
    'column 1': 'Tiger 3',
    'column 2': 'Bear 3',
    'column 3': 'Moose 3'
}
p_animals3 = pd.Series(animals)

print(p_animals1, '\n')
print(p_animals2, '\n')
print(p_animals3, '\n')

column 1    Tiger 1
column 2     Bear 1
column 3    Moose 1
dtype: object

column 1    Tiger 2
column 2     Bear 2
column 3    Moose 2
dtype: object

column 1    Tiger 3
column 2     Bear 3
column 3    Moose 3
dtype: object

In [52]:
df = pd.DataFrame([p_animals1, p_animals2, p_animals3], index=['row 1', 'row 2', 'row 3'])
df

      column 1 column 2 column 3
row 1  Tiger 1   Bear 1  Moose 1
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [53]:
df3 = df[['column 1', 'column 2']]
df3

      column 1 column 2
row 1  Tiger 1   Bear 1
row 2  Tiger 2   Bear 2
row 3  Tiger 3   Bear 3

In [54]:
df3.drop('row 1', inplace=True)

C:\Users\Sadra\AppData\Local\Temp\ipykernel_10192\2902963489.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('row 1', inplace=True)

In [55]:
df3

      column 1 column 2
row 2  Tiger 2   Bear 2
row 3  Tiger 3   Bear 3

In [56]:
df

      column 1 column 2 column 3
row 1  Tiger 1   Bear 1  Moose 1
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [57]:
df4 = df[:]
df4

      column 1 column 2 column 3
row 1  Tiger 1   Bear 1  Moose 1
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [58]:
df4.drop('row 1', inplace=True)
df4

C:\Users\Sadra\AppData\Local\Temp\ipykernel_10192\68996694.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('row 1', inplace=True)

      column 1 column 2 column 3
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [59]:
df

      column 1 column 2 column 3
row 1  Tiger 1   Bear 1  Moose 1
row 2  Tiger 2   Bear 2  Moose 2
row 3  Tiger 3   Bear 3  Moose 3

In [60]:
df['column 1'] = 1
df

       column 1 column 2 column 3
row 1         1   Bear 1  Moose 1
row 2         1   Bear 2  Moose 2
row 3         1   Bear 3  Moose 3

In [61]:
df['column 1'] = df['column 1'] * 2
df

       column 1 column 2 column 3
row 1         2   Bear 1  Moose 1
row 2         2   Bear 2  Moose 2
row 3         2   Bear 3  Moose 3

In [62]:
column_2 = df['column 2']
column_2 += ' !'
column_2

row 1    Bear 1 !
row 2    Bear 2 !
row 3    Bear 3 !
Name: column 2, dtype: object

In [63]:
df

       column 1  column 2 column 3
row 1         2  Bear 1 !  Moose 1
row 2         2  Bear 2 !  Moose 2
row 3         2  Bear 3 !  Moose 3